app/controllers/houses_controller.rb

INSERT INTO "houses" ("name", "source", "author", "motto", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Dorin"], ["source", "Mine"], ["author", "Me"], ["motto", "Keep Calm and Carry On"], ["created_at", 2017-04-13 22:01:33 UTC], ["updated_at", 2017-04-13 22:01:33 UTC]]
---
  def create
    @house = House.new(house_params)

    if @house.save