app/controllers/members_controller.rb

  def create
    @house = House.find(params[:house_id])
    @member = Member.new(member_params)
    @member.house = @house

    if @member.save
---
INSERT INTO "members" ("first_name", "last_name", "house_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "Taylor"], ["last_name", "Dorin"], ["house_id", 1], ["created_at", 2017-04-13 23:07:37 UTC], ["updated_at", 2017-04-13 23:07:37 UTC]]